INFORMATICA-INDUSTRIAL-GRUPO-1/Codigo-Proyecto/ESP8266/Global_G1/fota.cpp
// Programa Asignatura INFORMATICA INDUSTRIAL Grupo1
// Codigo ESP8266
// Version V.0.0.01a
// Autores
//
//
//
//
//
// Fecha de creacion: 28/11/2020
// 
// Pestaña:datos.cpp
// Descripcion del codigo
//    Aqui se recogen las distintas variables que requieren configuracion
//

////////////////////Seccion librerias y pestañas//////////////////////////////

#include <Arduino.h>

#include <ESP8266httpUpdate.h>
#include "datos.h"
#include "mqtt.h"
#include "debug.h"
#include "fota.h"
#include "config.h"
////////////////////Declaraciones//////////////////////////////


////////////////////Funciones//////////////////////////////


void FuncionActualizacion()
{
  debugFunction ("--------------------",1);
  debugFunction ("Comprobando actualización:",1);
  debugFunction ("--------------------",1);
  debugFunction ("--------------------",1);
  debugFunction ("/d",0);
  debugFunction (HTTP_OTA_ADDRESS,0);
  debugFunction (":",0);
  debugFunction (String(HTTP_OTA_PORT),0);
  debugFunction (HTTP_OTA_PATH,0);
  debugFunction ("",1);
  debugFunction ("--------------------",1);  
  ESPhttpUpdate.setLedPin(16,LOW);
  ESPhttpUpdate.onStart(inicio_OTA);
  ESPhttpUpdate.onError(error_OTA);
  ESPhttpUpdate.onProgress(progreso_OTA);
  ESPhttpUpdate.onEnd(final_OTA);
  switch(ESPhttpUpdate.update(HTTP_OTA_ADDRESS, HTTP_OTA_PORT, HTTP_OTA_PATH, HTTP_OTA_VERSION)) {
    case HTTP_UPDATE_FAILED:
      Serial.printf(" HTTP update failed: Error (%d): %s\n", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
      break;
    case HTTP_UPDATE_NO_UPDATES:
      Serial.println(F(" El dispositivo ya está actualizado"));
      break;
    case HTTP_UPDATE_OK:
      Serial.println(F(" OK"));
      break;
    }



  
}


void final_OTA()
{
  Serial.println("Fin OTA. Reiniciando...");
}

void inicio_OTA()
{
  actualiza_mqtt();
  Serial.println("Nuevo Firmware encontrado. Actualizando...");
}

void error_OTA(int e)
{
  char cadena[64];
  snprintf(cadena,64,"ERROR: %d",e);
  Serial.println(cadena);
}

void progreso_OTA(int x, int todo)
{
  char cadena[256];
  int progress=(int)((x*100)/todo);
  if(progress%10==0)
  {
    snprintf(cadena,256,"Progreso: %d%% - %dK de %dK",progress,x/1024,todo/1024);
    Serial.println(cadena);
  }
}
